In [190]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [191]:
# Chargement du DataFrame
name_basics_path = 'D:\\Projo\\Projet-Data-IA\\BDD_creuse\\name.basics.tsv'
df_nameBasics = pd.read_csv(name_basics_path, sep='\t', na_values='\\N')

# Aper√ßu des 10 premieres lignes du DataFrame
df_nameBasics.head(10)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899.0,1987.0,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934.0,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949.0,1982.0,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"
5,nm0000006,Ingrid Bergman,1915.0,1982.0,"actress,producer,soundtrack","tt0034583,tt0036855,tt0038109,tt0038787"
6,nm0000007,Humphrey Bogart,1899.0,1957.0,"actor,producer,miscellaneous","tt0034583,tt0042593,tt0043265,tt0037382"
7,nm0000008,Marlon Brando,1924.0,2004.0,"actor,director,writer","tt0078788,tt0068646,tt0047296,tt0070849"
8,nm0000009,Richard Burton,1925.0,1984.0,"actor,producer,director","tt0061184,tt0087803,tt0059749,tt0057877"
9,nm0000010,James Cagney,1899.0,1986.0,"actor,director,producer","tt0029870,tt0031867,tt0042041,tt0035575"

In [192]:
#forme du dataframe
df_nameBasics.shape

(13387604, 6)

In [180]:
df_nameBasics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13387604 entries, 0 to 13387603
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          float64
 3   deathYear          float64
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: float64(2), object(4)
memory usage: 612.8+ MB

In [193]:
df_nameBasics.describe()

           birthYear      deathYear
count  622203.000000  226895.000000
mean     1953.690643    1992.959801
std        35.533801      36.673797
min         1.000000      17.000000
25%      1933.000000    1979.000000
50%      1960.000000    2001.000000
75%      1980.000000    2014.000000
max      2023.000000    2024.000000

In [194]:
# Proportion (%) des valeurs nulles
df_nameBasics.isna().sum() / len(df_nameBasics) * 100

nconst                0.000000
primaryName           0.000418
birthYear            95.352395
deathYear            98.305186
primaryProfession    19.148721
knownForTitles       10.978529
dtype: float64

In [183]:
df_nameBasics.dtypes

nconst                object
primaryName           object
birthYear            float64
deathYear            float64
primaryProfession     object
knownForTitles        object
dtype: object

In [195]:
# Supprimer les deux premiers caract√®res de chaque valeur dans la colonne nconst
df_nameBasics['nconst'] = df_nameBasics['nconst'].str[2:]

# Convertir la colonne nconst en int64
df_nameBasics['nconst'] = df_nameBasics['nconst'].astype('int64')

df_nameBasics.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,1,Fred Astaire,1899.0,1987.0,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,2,Lauren Bacall,1924.0,2014.0,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,3,Brigitte Bardot,1934.0,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,4,John Belushi,1949.0,1982.0,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,5,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"

In [199]:
df_nameBasics.drop(columns=['birthYear', 'deathYear'], inplace=True)
df_nameBasics.head()

,nconst,primaryName,primaryProfession,knownForTitles
0,1,Fred Astaire,"[actor, miscellaneous, producer]","tt0072308,tt0050419,tt0053137,tt0027125"
1,2,Lauren Bacall,"[actress, soundtrack, archive_footage]","tt0037382,tt0075213,tt0117057,tt0038355"
3,4,John Belushi,"[actor, writer, music_department]","tt0072562,tt0077975,tt0080455,tt0078723"
4,5,Ingmar Bergman,"[writer, director, actor]","tt0050986,tt0083922,tt0050976,tt0069467"
5,6,Ingrid Bergman,"[actress, producer, soundtrack]","tt0034583,tt0036855,tt0038109,tt0038787"

In [200]:
df_nameBasics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 212836 entries, 0 to 13387562
Data columns (total 4 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   nconst             212836 non-null  int64
 1   primaryName        212836 non-null  object
 2   primaryProfession  212836 non-null  object
 3   knownForTitles     201612 non-null  object
dtypes: int64(1), object(3)
memory usage: 8.1+ MB

In [187]:
df_nameBasics.describe()

             nconst      birthYear      deathYear
count  2.128360e+05  212836.000000  212836.000000
mean   1.995283e+06    1921.022764    1992.156365
std    2.993244e+06      35.901075      36.327287
min    1.000000e+00       4.000000      17.000000
25%    3.819752e+05    1906.000000    1978.000000
50%    7.857280e+05    1924.000000    2000.000000
75%    1.966790e+06    1938.000000    2014.000000
max    1.598466e+07    2022.000000    2024.000000

In [197]:
df_nameBasics.head(100)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,1,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,2,Lauren Bacall,1924,2014,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
3,4,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,5,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"
5,6,Ingrid Bergman,1915,1982,"actress,producer,soundtrack","tt0034583,tt0036855,tt0038109,tt0038787"
...,...,...,...,...,...,...
262,263,Kirstie Alley,1951,2022,"actress,producer,writer","tt0084726,tt0157503,tt0097778,tt0114852"
264,265,Robert Altman,1925,2006,"director,producer,writer","tt0280707,tt0073440,tt0108122,tt0105151"
272,273,Alan Arkin,1934,2023,"actor,director,writer","tt1024648,tt0449059,tt0104348,tt0099487"
276,277,Richard Attenborough,1923,2014,"actor,producer,director","tt0107290,tt0057115,tt0083987,tt0119567"
289,290,John Barry,1933,2011,"music_department,composer,actor","tt0099348,tt0089755,tt0093428,tt0081534"

In [198]:
# Convertir les valeurs non-cha√Ænes en une liste vide
df_nameBasics['primaryProfession'] = df_nameBasics['primaryProfession'].apply(lambda x: [] if isinstance(x, float) else x)

# Diviser la cha√Æne en une liste et retirer les virgules
df_nameBasics['primaryProfession'] = df_nameBasics['primaryProfession'].apply(lambda x: [profession.strip() for profession in x.split(',')] if isinstance(x, str) else [])

# Afficher les premi√®res lignes pour v√©rifier le r√©sultat
print(df_nameBasics['primaryProfession'].head())

0          [actor, miscellaneous, producer]
1    [actress, soundtrack, archive_footage]
3         [actor, writer, music_department]
4                 [writer, director, actor]
5           [actress, producer, soundtrack]
Name: primaryProfession, dtype: object

In [201]:
# Convertir les valeurs non-cha√Ænes en une liste vide
df_nameBasics['knownForTitles'] = df_nameBasics['knownForTitles'].apply(lambda x: [] if isinstance(x, float) else x)

# Diviser la cha√Æne en une liste et retirer les virgules
df_nameBasics['knownForTitles'] = df_nameBasics['knownForTitles'].apply(lambda x: [title.strip() for title in x.split(',')] if isinstance(x, str) else [])

# Afficher les premi√®res lignes pour v√©rifier le r√©sultat
print(df_nameBasics['knownForTitles'].head())

0    [tt0072308, tt0050419, tt0053137, tt0027125]
1    [tt0037382, tt0075213, tt0117057, tt0038355]
3    [tt0072562, tt0077975, tt0080455, tt0078723]
4    [tt0050986, tt0083922, tt0050976, tt0069467]
5    [tt0034583, tt0036855, tt0038109, tt0038787]
Name: knownForTitles, dtype: object

In [202]:
# Enregistrement du DataFrame nettoy√© dans un nouveau fichier
df_nameBasics.to_csv('cleaned_name_basics.csv', index=False)